function sample(array) {
	return array[Math.floor(Math.random() * array.length)];
}

const food = ["شوید پلو با مرغ",
	"زرشک پلوبامرغ",
	"جوجه کباب",
	"فیله سوخاری",
	"مرغ سوخاری",
	"چیکن استراگانوف",
	"جوجه چینی",
	"مرغ و آلو",
	"مرغ شکم پر",
	"ته چین مرغ",
	"ساندویج مرغ",
	"کوکوسبزی",
	"کوکو سیب زمینی",
	"کوکو کدوسبز",
	"کوکواسفناج",
	"کوکو ذرت",
	"کتلت",
	"عدس پلو",
	"لوبیا پلو",
	"نخود پلو",
	"ماش پلو",
	"کلم پلو",
	"سبزی پلو با ماهی",
	"ماهی شکم پر",
	"ماهی کبابی",
	"قلیه ماهی",
	"قیمه",
	"قیمه بادمجان",
	"قرمه سبزی",
	"استانبولی",
	"دمپختک",
	"الویه",
	"سالادماکارانی"
]


$(document).ready(function() {
						   
	$("#shamchist").click(function(){
				document.getElementById("outsham").innerText = sample(food)
			});

});	